import "./AboutUsAndPrivacyPolicy.css";

const AboutUs = () => {
  return (
    <>
      <h2>Մեր մասին</h2>
      <p>
        DataGrip-ը CyberHUB հասարակական կազմակերպության 
        <a href="http://cyberhub.am/hy/"> https://cyberhub.am/hy </a> 
        նախաձեռնությունն է։
      </p>
      <p>
        DataGrip-ը նախաձեռնվել է այն պատճառով, որ մի կողմից
        հայաստանյան տվյալների տարբեր բազաներից տեղի է ունենում տվյալների
        արտահոսք, մյուս կողմից՝ տվյալներ մշակողները՝ էլեկտրոնային համակարգը
        տնօրինողները, տվյալների բազաներ վարողները, հազվադեպ են հայտարարություն
        տարածում արտահոսքի, արտահոսած տվյալների վերաբերյալ, ինչի արդյուքնում
        մարդիկ հաճախ տեղեկացված չեն լինում, որ իրենց այս կամ այն անձնական տվյալն
        արտահոսել է։
      </p>
      <p>
        DataGrip-ի նպատակն է լրացնել արտահոսքի վերաբերյալ
        տեղեկությունների հրապարակման բացը եւ հնարավորություն տալ մարդկանց
        պարզել՝ արդյոք իրենց տվյալները ենթարկվել են արտահոսքի։
      </p>
    </>
  );
};

export default AboutUs;
