import "./AboutUsAndPrivacyPolicy.css";

const Privacy = () => {
  return (
    <>
      <h2>Գաղտնիության քաղաքականություն</h2>
      <p>
        Էլեկտրոնային համակարգերից անձնական տվյալների արտահոսքի դեպքում անձնական
        տվյալներ մշակողը՝ էլեկտրոնային համակարգը տնօրինողը, տվյալների բազան
        վարողը եւ այլն, պարտավոր է ի թիվս այլնի արտահոսքի մասին անհապաղ
        հրապարակել հայտարարություն։ Արտահոսքի մասին պարտադիր հրապարակման պահանջն
        առկա է ինչպես Հայաստանի Անձնական տվյալների պաշտպանության մասին օրենքում,
        այնպես էլ միջազգային համապատասխան փաստաթղթերում։ Արտահոսքի մասին
        տեղեկության հրապարակումը կարեւոր է, քան որ մարդիկ, ում տվյալները
        արտահոսել են, կարողանում են այդպիսով իրականացնել իրենց իրավունքի
        ինքնապաշտպանություն (փոխել այն անձնագիրը, որի տվյալներն արտահոսել են,
        փոխել գաղտնաբառերը կանխել իր տվյալների օգտագործմամբ հնարավոր անօրինական
        միջամտությունները եւ այլն)։
      </p>
      <p>
        Սակայն, փաստացի, ՀՀ քաղաքացիների տվյալների արտահոսքերի դեպքում տվյալներ
        մշակողները գրեթե երբեք չեն տարածում հայտարարություն արտահոսքի վերաբերյալ
        (պատճառները կարող են տարբեր լինել՝ օրենքի չիմացությունը, արտահոսքի մասին
        անտեղյակությունը եւ այլն)։
      </p>
      <p>
        DataGrip-ի նպատակն է լրացնել արտահոսքի վերաբերյալ
        տեղեկությունների հրապարակման բացը եւ հնարավորություն տալ մարդկանց որոնել
        իրենց տվյալները արտահոսած տվյալներում, տեղեկանալ, արդյոք տեղի է ունեցել
        իրենց տվյալների արտահոսք, եթե այո, ապա որ տվյալների։ DataGrip-ը տվյալների մշակման նպատակ (այդ թվում՝ առեւտրային) չի
        հետապնդում։
      </p>
      <h3>
        Արտահոսած տվյալները, որոնցում որոնումը հասանելի է DataGrip-ում
      </h3>
      <p>
        DataGrip-ում հասանելի են հայաստանյան տվյալներ մշակողների
        բազաներում առկա արտահոսած եւ հանրամատչելի/հասանելի դարձած անձնական
        տվյալները։ DataGrip-ի աշխատակիցները մշտադիտարկում են
        համացանցում, ներառյալ՝ սոցիալական ցանցերում, հայաստանյան տվյալների
        բազաներից արտահոսքի վերաբերյալ տեղեկությունները, եւ արտահոսած տվյալներ
        հայտնաբերելու դեպքում դրանք ներառում են DataGrip-ի
        պահոցում։
      </p>
      <h3>Արտահոսած եւ որոնվող տվյալների հետ կատարվող գործողությունները</h3>
      <p>
        Արտահոսած եւ հանրամատչելի/հասանելի դարձած անձնական տվյալները DataGrip-ի պահոցում ներառվելուց հետո գաղտնագրվում են։ DataGrip-ում որոնում կատարելու դեպքում որոնվող տվյալը համադրվում է
        DataGrip-ի պահոցում առկա տվյալների հետ եւ համընկնման
        դեպքում որոնում կատարողին ներկայացվում է տեղեկություն արտահոսքում
        որոնվող տվյալի առկայության, ինչպես նաեւ որոնվող տվյալի հետ փոխկապակցված
        եւ նույն անձին վերաբերող այլ տվյալների մասին՝ առանց որոնող կատարողի
        համար բացահայտելու DataGrip-ի պահոցում առկա տվյալները։
      </p>
      <p>
        DataGrip-ը չի հավաքում եւ չի պահպանում արտահոսած
        տվյալներում որոնում կատարելու համար որոնողի կողմից որոնվող (DataGrip-ում ներմուծվող) անձնական տվյալները։ Որոնման համար անձնական
        տվյալը DataGrip-ում որոնելուց հետո համադրվում է DataGrip-ի պահոցում առկա տվյալների հետ եւ արտահոսած տվյալների հետ
        չհամըննելու դեպքում որոնում կատարողին ներկայացվում է տեղեկություն
        արտահոսքում որոնվող տվյալի բացակայության մասին, իսկ որոնվող (DataGrip-ում ներմուծվող) տվյալը ոչնչացվում է։
      </p>
      <h3>Տվյալների անվտանգության միջոցառումները</h3>
      <p>
        DataGrip-ը հաշվի է առնում, որ արտահոսած տվյալները
        հանրամատչելի/հասանելի են դարձել տվյալների բազաների հետ կատարված
        անօրինական գործողությունների արդյունքում (հաջողված կիբերհարձակում,
        տվյալներ մշակողի կողմից տվյալների անվտանգության ապահովման ոչ բավարար
        միջոցառումներ եւ այլն), ուստի DataGrip-ը կիրառում է
        անվտանգության տեխնիկական եւ կազմակերպչական միջոցառումներ՝ արտահոսած
        տվյալների հետագա տարածումը, դրանց հասանելիությունն այլ անձանց համար
        կանխելու համար։
      </p>
      <p>
        Մասնավորապես, արտահոսած եւ հանրամատչելի/հասանելի դարձած անձնական
        տվյալները DataGrip-ի պահոցում ներառվելուց հետո գաղտնագրվում
        են,․ գաղտնագրվում է նաեւ որոնվող (DataGrip-ում ներմուծվող)
        տվյալը։ Որոնվող եւ DataGrip-ի պահոցում առկա տվյալների
        համադրութունն իրակացվում է գաղտնագրված տվյալներով։
      </p>
      <p>
        DataGrip-ը նպատակ ունի անձին հնարավորություն տալ պարզելու՝
        արդյոք արտահոսքի ենթարկվել են իր տվյալները։ Միաժամանակ, DataGrip-ը հաշվի է առնում, որ որոնում կարող է իրականացնել ցանկացած
        անձհանեւ այլ անձի տվյալներով, ուստի, որոնում կատարողին DataGrip-ի
        պահոցում առկա տվյալները չեն ներկայացվելու բաց եղականով․ որոնում կատարողը
        ստանալու է տեղեկություն միայն արտահոսած տվյալների շրջանակի վերաբերյալ՝
        առանց տեսնելու բուն անձնական տվյալը․ Տվյալների (որոնման) հավաստիությունը
        եւ պատշաճություննապահովելու համար որոշ դեպքերում որոնում կատարողին կարող
        են ներկայացվել ապանձնավորված տվյալներ (DataGrip-ի պահոցում
        առկա այս կամ այն տվյալի մի մասը)։ Օրինակ, եթե պարզվի, որ արտահոսած
        տվյալների շրջանակում առկա են անձնագրային տվյալներ, ապա սխալանքը
        բացառելու համար որոնում կատարողին կարող է ներկայացվել անձնագրի սերիայի
        վերջին երկու թիվը։ Մի կողմից, եթե անձը որոնում է իր տվյալները, ապա սա
        հնարավորություն կտա որոնողին համոզվելու, որ իսկապես իր տվյալները կամ իր
        արդիական տվյալներն են արտահոսել, մյուս կողմից, եթե անձը որոնել է
        այլմադու տվյալներ, ապա որոնման արդյունքում, անգամ համընկնման դեպքում
        որոնողին հասանելի չեն դառնա DataGrip-ի պահոցում առկա
        անձնական տվյալները։
      </p>
      <p>
        DataGrip-ի պահոցում առկա անձնական տվյալները երրորդ անձանց
        չեն փոխանցվելու՝ բացառությամբ օրենքովուղղակիորեն նախատեսված դեպքերի։
      </p>
      <h3>Որոնողի վարքագծի վերահսկողությունը(cookie նիշքեր)</h3>
      <p>
        DataGrip-ը որեւէ կերպ չի վերահսկում որոնողի վարքագիծը, չի
        արձանագրում կամ ամրագրում կամ պահպանում որոնողի որոնման արդյունքները,չի
        մշակում cookie նիշքեր։
      </p>
      <h3>
        DataGrip-ի պահոցում առկա տվյալների ուղղումը, ոչնչացումը
      </h3>
      <p>
        Տվյալները DataGrip-ի պահոցում ներառվում են նույնությամբ,
        ինչպես առկա են եղել արտահոսքի արդյունքում հանրամատչելի/հասանելի են
        դարձած կամ հրապարակված աղբյուրում։ Հետեւաբար, DataGrip-ի
        պահոցում առկա տվյալներն ուղղման ենթակա չեն, դրանք կարող են ոչնչացվել
        միայն օրենքով ուղղակիորեն նախատեսված դեպքերում։ DataGrip-ը
        ողջամիտ ջանքեր է գործադրելու ապահովելուիր պահոցում առկա տվյալների
        ամբողջականությունը եւ թարմացվածությունը, այն է՝ հնարավորինս ապահովելու
        է, որ DataGrip-ի պահոցը պարունակի է․ բոլոր արտահոսքերի
        արդյունքում արտահոսած եւ հանրամատչելի/հասանելի դարձած տվյալների մասին
        տեղեկություններ։
      </p>
      <p>
         * Որոնում կատարելուց կամ կայքը բացելուց հաղորդագրություն, որ կարդացել են
          եւ համաձայն են գաղտնիության քաղաքականությանը։
       </p>
    </>
  );
};

export default Privacy;
